In [1]:
import numpy as np
import pandas as pd

In [211]:
dpm = pd.read_csv("department.csv", names =["Id", "Name"] )
dpm.head(2)

   Id   Name
0   1     IT
1   2  Sales

In [224]:
epl_1 = pd.read_csv("employee_01.csv", names = ["Id", "Name", "Salary", "ManagerId"])
epl_1.head(2)

   Id   Name  Salary ManagerId
0   1    Joe   70000         3
1   2  Henry   80000         4

In [210]:
epl_2 = pd.read_csv("employee_02.csv", names = ["Id", "Name", "Salary", "DepartmentId"])
epl_2.head(2)

   Id Name  Salary  DepartmentId
0   1  Joe   70000             1
1   2  Jim   90000             1

In [28]:
epl_1

   Id   Name  Salary ManagerId
0   1    Joe   70000         3
1   2  Henry   80000         4
2   3    Sam   60000       NaN
3   4    Max   90000

1. Dùng pandas liệt kê ra các employees có salary cao hơn manager của mình.

In [225]:
epl_1['ManagerId'].dtype
#epl_1['Id'].dtype

dtype('O')

In [226]:
epl_1['ManagerId'] = epl_1['ManagerId'].fillna(0)
epl_1['ManagerId'] = epl_1['ManagerId'].replace(' ', 0)
epl_1['ManagerId'] = epl_1['ManagerId'].astype('int64')

In [228]:
epl_1

   Id   Name  Salary  ManagerId
0   1    Joe   70000          3
1   2  Henry   80000          4
2   3    Sam   60000          0
3   4    Max   90000          0

In [229]:
epl_1_Manager =  epl_1[['ManagerId']]
epl_1_Manager

   ManagerId
0          3
1          4
2          0
3          0

In [233]:
epl_1_Manager = pd.merge(epl_1[['Id', 'Salary']], epl_1_Manager, left_on = 'Id', right_on = 'ManagerId', how = 'right')
#epl_1_Manager = epl_1_Manager.rename(columns = {'Id' : 'ManagerId'})

In [234]:
epl_1_Manager

    Id   Salary  ManagerId
0  3.0  60000.0          3
1  4.0  90000.0          4
2  NaN      NaN          0
3  NaN      NaN          0

In [236]:
epl_1 = pd.merge(epl_1, epl_1_Manager [['Salary', 'ManagerId']], on = 'ManagerId', how = 'left')
epl_1

   Id   Name  Salary_x  ManagerId  Salary_y
0   1    Joe     70000          3   60000.0
1   2  Henry     80000          4   90000.0
2   3    Sam     60000          0       NaN
3   3    Sam     60000          0       NaN
4   4    Max     90000          0       NaN
5   4    Max     90000          0       NaN

In [238]:
epl_1[epl_1['Salary_x'] > epl_1['Salary_y']]['Name'].values[0]

'Joe'

2.Dùng pandas viết truy vấn tìm ra các employees có mức lương cao nhất của mỗi phòng ban.

In [212]:
epl_2.sort_values(by= ['DepartmentId', 'Salary'], ascending = False)

   Id   Name  Salary  DepartmentId
2   3  Henry   80000             2
3   4    Sam   60000             2
1   2    Jim   90000             1
4   5    Max   90000             1
0   1    Joe   70000             1

In [214]:
dpm = dpm.rename(columns = {'Name' : 'Department', 'Id' : 'DepartmentId'})

In [215]:
dpm

   DepartmentId Department
0             1         IT
1             2      Sales

In [217]:
epl_2 = pd.merge(epl_2, dpm, on = 'DepartmentId', how = 'left')

In [218]:
epl_2

   Id   Name  Salary  DepartmentId Department
0   1    Joe   70000             1         IT
1   2    Jim   90000             1         IT
2   3  Henry   80000             2      Sales
3   4    Sam   60000             2      Sales
4   5    Max   90000             1         IT

In [219]:
epl_2.sort_values(by= ['DepartmentId', 'Salary'], ascending = False)

   Id   Name  Salary  DepartmentId Department
2   3  Henry   80000             2      Sales
3   4    Sam   60000             2      Sales
1   2    Jim   90000             1         IT
4   5    Max   90000             1         IT
0   1    Joe   70000             1         IT

In [223]:
epl_2.groupby('DepartmentId').apply(lambda x: x[x['Salary'] == x['Salary'].max()])

                Id   Name  Salary  DepartmentId Department
DepartmentId
1            1   2    Jim   90000             1         IT
             4   5    Max   90000             1         IT
2            2   3  Henry   80000             2      Sales